Autodesk.Revit.DB.DirectShapeType.GetOptions
Gets a copy of the current options for this DirectShapeType.
Returns:
Options currently set for this DirectShapeType.
Since:
2021

Autodesk.Revit.DB.DirectShapeType.SetOptions(Autodesk.Revit.DB.DirectShapeTypeOptions)
Sets the options to use for this DirectShapeType.
Remarks:
The new options take effect immediately.
options:
Options to use for this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The DirectShapeTypeOptions provided are not valid for this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.DirectShapeType.AreOptionsValid(Autodesk.Revit.DB.DirectShapeTypeOptions)
Validates that the given DirectShapeTypeOptions are allowed for this particular DirectShapeType.
options:
The options object.
Returns:
True if the DirectShapeTypeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.DirectShapeType.HasExternalGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Checks whether the externally tagged geometry is already present in this DirectShapeType.
externalId:
The external ID of the externally tagged geometry to check.
Returns:
True if such an externally tagged geometry is already present in this DirectShapeType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.ResetExternallyTaggedGeometry
Removes all of the externally tagged geometry in this DirectShapeType.
Since:
2022

Autodesk.Revit.DB.DirectShapeType.UpdateExternallyTaggedGeometry(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Updates the externally tagged geometry object in the DirectShapeType.
externallyTaggedGeometry:
The externally tagged geometry that should be updated in the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input shape does not satisfy DirectShapeType validation criteria.
-or-
A previous version of the externally tagged geometry is not present in this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.RemoveExternallyTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Removes the externally tagged geometry object by its external ID from this DirectShapeType.
externalId:
The external ID of the externally tagged geometry that should be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The externally tagged geometry with the input externalId is not present in this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.GetExternallyTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Gets the externally tagged geometry by its external ID that is stored in this DirectShapeType.
externalId:
The external ID of the externally tagged geometry that should be obtained.
Returns:
The externally tagged geometry.
Or null if there is no such externally tagged geometry in the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddExternallyTaggedGeometry(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Adds the externally tagged geometry object to the DirectShapeType.
externallyTaggedGeometry:
The externally tagged geometry that should be added to the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input shape does not satisfy DirectShapeType validation criteria.
-or-
The input geometry does not have a permitted usage.
-or-
The externallyTaggedGeometry has already been added to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.IsValidUsage(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Validates that the ExternallyTaggedGeometryObject's usage is set to an allowed value for a DirectShapeType.
externallyTaggedGeometry:
The geometry to check.
Returns:
True if the usage is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.IsValidShape(Autodesk.Revit.DB.ExternallyTaggedGeometryObject)
Validates shape to be stored in a DirectShapeType.
Remarks:
This function uses the same criteria as IsValidShape(GeometryObject).
externallyTaggedGeometry:
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.IsValidReferencePlaneBoundingBoxUV(Autodesk.Revit.DB.BoundingBoxUV)
Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface.
The input BoundingBoxUV must be set and not degenerate.
boundingBoxUV:
The reference plane BoundingBoxUV to test.
Returns:
True if the input BoundingBoxUV is valid for reference plane surfaces, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.IsValidReferenceCurve(Autodesk.Revit.DB.Curve)
Validates that the input curve is suitable for creating a direct shape type reference curve.
Bounded and unbounded lines are accepted.
Other bounded and unbounded curve types with natural bounds are accepted if they are not closed.
Unbounded periodic curves are not allowed.
curve:
The curve to test.
Returns:
True if the input curve point can be used to create a direct shape reference curve, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AreValidDirectShapeReferenceOptions(Autodesk.Revit.DB.DirectShapeReferenceOptions)
Validates that the input DirectShapeReferenceOptions are suitable for creating a direct shape reference object.
If the options specify an ExternalGeometryId, it must not correspond to any existing reference object
belonging to the DirectShapeType.
options:
The options to test.
Returns:
True if the options can be used to add a reference object to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.RemoveAllReferenceObjects
Removes all reference objects (if any) from the DirectShapeType.
Since:
2024

Autodesk.Revit.DB.DirectShapeType.RemoveReferenceObject(Autodesk.Revit.DB.ExternalGeometryId)
Removes any reference object associated with the provided ExternalGeometryId from the DirectShapeType.
Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
externalId:
The ExternalGeometryId of the reference object to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.RemoveReferenceObject(System.String)
Removes any reference objects with the given name from the DirectShapeType.
Nothing is done if no reference objects have the given name or if the name is the empty string.
refName:
The name of the reference object(s) to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.AddReferencePoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference point to the DirectShapeType.
refPoint:
The coordinates of the new reference point.
options:
The options that are used to configure the new reference point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
-or-
options cannot be used to add a reference object to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePoint(Autodesk.Revit.DB.XYZ)
Adds a reference point to the DirectShapeType.
refPoint:
The coordinates of the new reference point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.BoundingBoxUV,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
boundingBoxUV:
If boundingBoxUV is set, the resulting reference plane that is added to the DirectShapeType will be displayed
with those bounds. Note that the specified bounds must not be degenerate.
If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane.
The automatic bounds are based on the host direct shape's geometry.
options:
The options that are used to configure the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface.
-or-
options cannot be used to add a reference object to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
options:
The options that are used to configure the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options cannot be used to add a reference object to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.BoundingBoxUV)
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
boundingBoxUV:
If boundingBoxUV is set, the resulting reference plane that is added to the DirectShapeType will be displayed
with those bounds. Note that the specified bounds must not be degenerate.
If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane.
The automatic bounds are based on the host direct shape's geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane)
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
refPlane:
The geometry of the new reference plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferenceCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference curve to the DirectShapeType.
refCurve:
The geometry of the new reference curve.
First case: The input curve's bounds are set. The resulting reference curve that is added to the
DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate.
Second case: The input curve is unbounded. Reasonable bounds are therefore automatically calculated
and applied to the input curve. The automatic bounds are based on the host direct shape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
options:
The options that are used to configure the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
-or-
options cannot be used to add a reference object to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferenceCurve(Autodesk.Revit.DB.Curve)
Adds a reference curve to the DirectShapeType.
refCurve:
The geometry of the new reference curve.
First case: The input curve's bounds are set. The resulting reference curve that is added to the
DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate.
Second case: The input curve is unbounded. Reasonable bounds are therefore automatically calculated
and applied to the input curve. The automatic bounds are based on the host direct shape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.GetExternallyTaggedReference(Autodesk.Revit.DB.ExternalGeometryId)
Retrieve a Reference to reference geometry of the DirectShapeType that is associated with a particular ExternalGeometryId.
externalId:
The ExternalGeometryId of the requested reference object.
Returns:
A Reference to the externally tagged reference GeometryObject having the provided external ID
or null if there is no reference geometry having the external ID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.HasExternallyTaggedReference(Autodesk.Revit.DB.ExternalGeometryId)
Checks if the externally tagged reference is already present in this DirectShapeType.
externalId:
The external ID of the tagged reference to check for.
Returns:
True if the DirectShapeType holds a reference with the specified ExternalGeometryId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.DirectShapeType.CanCreateParts
Indicates if it is possible to create parts from this DirectShapeType element.
Remarks:
While it is generally possible to create parts from DirectShape elements, some characteristics make parts creation impossible.
This property is re-evaluated every time the DirectShapeType's geometry is modified (via a call to SetShape or AppendShape).
Invalid configurations include: DirectShapeTypes containing a polymesh, or an open geometry, as well as DirectShapeTypes
not containing any solids and DirectShapeTypes configured as NotReferenceable (via a call to SetOptions).
Finally, if a DirectShapeType has other DirectShapeType instances in its geometry, and one of those other DirectShapeTypes
has a configuration that is incompatible with parts creation, the host DirectShapeType will also be incompatible
with parts creation.
Returns:
True if it is possible to create parts from this DirectShapeType.
Since:
2020

Autodesk.Revit.DB.DirectShapeType.IsValidShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type.
shape:
Shape of this object expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
The view type this shape is intended for.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.DirectShapeType.IsValidShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Validates shape to be stored in a DirectShapeType.
Remarks:
This function calls IsValidShape(GeometryObject) to validate each object in the list.
shape:
Shape to be validated represented as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.
Returns:
True if the supplied shape passes the validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.DirectShapeType.AppendShape(Autodesk.Revit.DB.ShapeBuilder)
Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShapeType.
The data stored in the supplied ShapeBuilder object will be cleared.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have teh correct appearance in Revit.
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the AppendShape() routine that accepts GeometryObjects directly as input.
ShapeBuilder:
The ShapeBuilder object that was used to build the shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShapeType.AppendShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShapeType.
Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of GeometryObjects.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType:
Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShapeType validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShapeType.AppendShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of GeometryObjects.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShapeType validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShapeType.SetShape(Autodesk.Revit.DB.ShapeBuilder)
Sets the shape of this object to the one accumulated in the supplied Builder object.
If the new shape is identical to the old one, the old shape will be kept.
Remarks:
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the SetShape() routine that accepts GeometryObjects directly as input.
Supplying a ViewShapeBuilder object as argument will cause the view-specific shape of this DirectShapeType to be updated.
Supplying other ShapeBuilder types will update the model shape.
pBuilder:
A ShapeBuilder object that was used to successfully build geometry to store in this DirectShapeType. The built shape will be
transferred to the DirectShapeType, and the ShapeBuilder object will be reset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.DirectShapeType.SetShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Builds the type shape from the supplied collection of GeometryObjects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of GeometryObjects. These will be copied.
Shape and Category should be consistent: geometry supplied as shape should be valid for the Category
the type object is associated with.
The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShapeType validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeType.CanChangeFamilyName
Checks whether the DirectShapeType supports a custom family name.
Returns:
True if a custom family name is supported, false otherwise.
Since:
2022

Autodesk.Revit.DB.DirectShapeType.SetFamilyName(System.String)
Sets the family name for the DirectShapeType.
Remarks:
By default the family name is either Direct Shape or a category-specific name. When a
category-specific name is used the family name cannot be set.
name:
Family name for the DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element type name was empty, contained invalid characters, or was invalid for the specific element type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The given DirectShapeType has a category which does not support a custom family name.
Since:
2022

Autodesk.Revit.DB.DirectShapeType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.DirectShapeTypeOptions)
Creates a DirectShapeType element.
document:
Document to which the created element will be added.
name:
Name of the DirectShapeType.
categoryId:
Id of the category assigned to this DirectShapeType. Must be a valid category id.
options:
Options that can be used to control the behavior of DirectShapeType being created.
Returns:
The new DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.DirectShapeType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId)
Creates a DirectShapeType element.
document:
Document to which the created element will be added. Must be a project document.
name:
Name of the DirectShapeType.
categoryId:
Id of the category assigned to this DirectShapeType. Must be a valid category id.
Returns:
The new DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
Document document may not contain DirectShape or DirectShapeType objects.
-or-
Element id categoryId may not be used as a DirectShape category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeType.UserAssignability
An option controlling the ability of DirectShapes to assign this DirectShapeType as its type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2023